constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

10
(
    frontAndBack
    {
        type            patch;
        nFaces          360;
        startFace       491894;
    }
    inlet
    {
        type            patch;
        nFaces          72;
        startFace       492254;
    }
    outlet
    {
        type            patch;
        nFaces          72;
        startFace       492326;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4616;
        startFace       492398;
    }
    upperWall
    {
        type            patch;
        nFaces          160;
        startFace       497014;
    }
    mainBody
    {
        type            wall;
        inGroups        2(mainBodyGroup wall);
        nFaces          71;
        startFace       497174;
    }
    FL
    {
        type            wall;
        inGroups        2(wheelGroup wall);
        nFaces          16;
        startFace       497245;
    }
    FR
    {
        type            wall;
        inGroups        2(wheelGroup wall);
        nFaces          16;
        startFace       497261;
    }
    RL
    {
        type            wall;
        inGroups        2(wheelGroup wall);
        nFaces          19;
        startFace       497277;
    }
    RR
    {
        type            wall;
        inGroups        2(wheelGroup wall);
        nFaces          19;
        startFace       497296;
    }
)

// ************************************************************************* //
